In [1]:
import pandas as pd
import numpy as np
import datetime as dt
import plydata as dp

In [2]:
df = pd.read_csv('../data/starbucks.csv', index_col = 'Date', parse_dates = True)

In [3]:
df.head()

              Close    Volume
Date
2015-01-02  38.0061   6906098
2015-01-05  37.2781  11623796
2015-01-06  36.9748   7664340
2015-01-07  37.8848   9732554
2015-01-08  38.4961  13170548

## Shift by periods

Shift non-indexed rows up or down. Default fill is NaN.

In [17]:
??df.shift

In [9]:
df.shift(periods = 1).head()

              Close      Volume
Date
2015-01-02      NaN         NaN
2015-01-05  38.0061   6906098.0
2015-01-06  37.2781  11623796.0
2015-01-07  36.9748   7664340.0
2015-01-08  37.8848   9732554.0

In [11]:
df.shift(periods = -1).tail()

            Close      Volume
Date
2018-12-24  63.08  16646238.0
2018-12-26  63.20  11308081.0
2018-12-27  63.39   7712127.0
2018-12-28  64.40   7690183.0
2018-12-31    NaN         NaN

## Shift with frequency

In [13]:
df.head()

              Close    Volume
Date
2015-01-02  38.0061   6906098
2015-01-05  37.2781  11623796
2015-01-06  36.9748   7664340
2015-01-07  37.8848   9732554
2015-01-08  38.4961  13170548

In [21]:
df.shift(2, freq = 'M').head()

              Close    Volume
Date
2015-02-28  38.0061   6906098
2015-02-28  37.2781  11623796
2015-02-28  36.9748   7664340
2015-02-28  37.8848   9732554
2015-02-28  38.4961  13170548